<a href="https://colab.research.google.com/github/hatchdavid1/r-course/blob/master/Python_Notes_for_ML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [11]:
###### Python Datos categ√≥ricos
# Codificar datos categoricos 
from sklearn.preprocessing import LabelEncoder
dataset = pd.read_csv('https://raw.githubusercontent.com/joanby/machinelearning-az/master/datasets/Part%201%20-%20Data%20Preprocessing/Section%202%20--------------------%20Part%201%20-%20Data%20Preprocessing%20--------------------/Data.csv')

In [14]:
labelencoder_x = LabelEncoder()
dataset['New_country'] = labelencoder_x.fit_transform(dataset.Country)
dataset.head()

   Country   Age   Salary Purchased  New_country
0   France  44.0  72000.0        No            0
1    Spain  27.0  48000.0       Yes            2
2  Germany  30.0  54000.0        No            1
3    Spain  38.0  61000.0        No            2
4  Germany  40.0      NaN       Yes            1